Revit 2027 API
BaseExportOptions.PropOverrides Property
 How to export overridden object styles. Default value is PropOverrideMode.ByEntity.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PropOverrideMode PropOverrides { get; set; }
Public Property PropOverrides As PropOverrideMode
	Get
	Set
public:
property PropOverrideMode PropOverrides {
	PropOverrideMode get ();
	void set (PropOverrideMode value);
}
member PropOverrides : PropOverrideMode with get, set
Property Value
PropOverrideMode
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
BaseExportOptions Class
Autodesk.Revit.DB Namespace